// ======================================================
// مدل فصل کتاب
// ======================================================
//
// این کلاس اطلاعات پایه هر فصل را نگهداری می‌کند.
// در آینده می‌توانیم اطلاعات بیشتری به آن اضافه کنیم.
// ======================================================

class Chapter {
  // عنوان فصل
  final String title;

  // مسیر محتوای فصل
  final String file;

  // شماره فصل
  final int number;

  // سازنده کلاس
  const Chapter({
    required this.title,
    required this.file,
    required this.number,
  });
}