// ======================================================
// مدل انواع محتوای کتاب
// ======================================================

import 'package:flutter/material.dart';

// ======================================================
// اندازه تصویر
// ======================================================

enum ImageSize {
  small,
  medium,
  full,
}

// ======================================================
// نوع محتوای کتاب
// ======================================================

enum ContentType {
  heading,
  text,
  image,
  formula,
  table,
  bullet,
  note,
  summary,
}

// ======================================================
// مدل محتوای کتاب
// ======================================================

class ContentBlock {
  final ContentType type;

  // ----------------------------------------------------
  // متن محتوا
  // ----------------------------------------------------
  final String? text;

  // ----------------------------------------------------
  // تراز متن
  // ----------------------------------------------------
  //
  // اگر null باشد، تراز پیش‌فرض Flutter استفاده می‌شود.
  //
  // مثال:
  // TextAlign.center
  // TextAlign.right
  // TextAlign.left
  // ----------------------------------------------------

  final TextAlign? textAlign;

  // ----------------------------------------------------
  // سطح عنوان
  // ----------------------------------------------------
  final int? headingLevel;

  // ----------------------------------------------------
  // شماره عنوان، مثل 1 یا 2.1
  // ----------------------------------------------------
  final String? number;

  // ----------------------------------------------------
  // اطلاعات تصویر
  // ----------------------------------------------------

  final String? imagePath;

  final String? caption;

  final ImageSize? imageSize;

  // ----------------------------------------------------
  // عرض سفارشی تصویر
  // ----------------------------------------------------
  //
  // مقدار به صورت درصدی از عرض فضای متن است.
  //
  // مثال:
  // 50 = پنجاه درصد
  // 75 = هفتاد و پنج درصد
  // 100 = تمام عرض
  //
  // اگر مقدار null باشد، اندازه پیش‌فرض استفاده می‌شود.
  // ----------------------------------------------------

  final double? imageWidth;

  // ----------------------------------------------------
  // اطلاعات جدول
  // ----------------------------------------------------

  final List<List<String>>? table;

  final String? tableCaption;

  // ====================================================
  // سازنده ContentBlock
  // ====================================================

  const ContentBlock({
    required this.type,

    this.text,

    // تراز متن
    this.textAlign,

    this.headingLevel,

    this.number,

    this.imagePath,

    this.caption,

    this.imageSize,

    // عرض سفارشی تصویر
    this.imageWidth,

    this.table,

    this.tableCaption,
  });
}